title: ESCU - Detect Regsvcs Spawning a Process - Rule
description: The following analytic identifies regsvcs.exe spawning a process. This
  particular technique has been used in the wild to bypass application control products.
  Regasm.exe and Regsvcs.exe are signed by Microsoft. Spawning of a child process
  is rare from either process and should be investigated further. During investigation,
  identify and retrieve the content being loaded. Review parallel processes for additional
  suspicious behavior. Gather any other file modifications and review accordingly.
  regsvcs.exe and regasm.exe are natively found in C:\Windows\Microsoft.NET\Framework\v*\regasm|regsvcs.exe
  and C:\Windows\Microsoft.NET\Framework64\v*\regasm|regsvcs.exe.
status: Active
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=regsvcs.exe\
      \ by Processes.dest Processes.user Processes.parent_process Processes.process_name\
      \ Processes.process Processes.process_id Processes.parent_process_id \n  - \
      \ `drop_dm_object_name(Processes)` \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `detect_regsvcs_spawning_a_process_filter`"
  level: critical
tags:
- "T1218\nT1218.009"
- System Binary Proxy Execution
- System Binary Proxy Execution
references: .nan
notes: .nan
