title: ESCU - Detect Regsvcs with Network Connection - Rule
description: The following analytic identifies Regsvcs.exe with a network connection
  to a public IP address, exluding private IP space. This particular technique has
  been used in the wild to bypass application control products. Regasm.exe and Regsvcs.exe
  are signed by Microsoft. By contacting a remote command and control server, the
  adversary will have the ability to escalate privileges and complete the objectives.
  During investigation, identify and retrieve the content being loaded. Review parallel
  processes for additional suspicious behavior. Gather any other file modifications
  and review accordingly. Review the reputation of the remote IP or domain and block
  as needed. regsvcs.exe and regasm.exe are natively found in C:\Windows\Microsoft.NET\Framework\v*\regasm|regsvcs.exe
  and C:\Windows\Microsoft.NET\Framework64\v*\regasm|regsvcs.exe.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "`sysmon` EventID=3 dest_ip!=10.0.0.0/12 dest_ip!=172.16.0.0/12 dest_ip!=192.168.0.0/16\
      \ process_name=regsvcs.exe \n  -  rename Computer as dest \n  -  stats count\
      \ min(_time) as firstTime max(_time) as lastTime by dest, user, process_name,\
      \ src_ip, dest_ip \n  -  `security_content_ctime(firstTime)` \n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `detect_regsvcs_with_network_connection_filter`"
  level: critical
tags:
- "T1218\nT1218.009"
- System Binary Proxy Execution
- System Binary Proxy Execution
references: Requires Sysmon data
notes: .nan
