title: ESCU - PowerShell 4104 Hunting - Rule
description: The following Hunting analytic assists with identifying suspicious PowerShell
  execution using Script Block Logging, or EventCode 4104. This analytic is not meant
  to be ran hourly, but occasionally to identify malicious or suspicious PowerShell.
  This analytic is a combination of work completed by Alex Teixeira and Splunk Threat
  Research Team.
status: Inactive
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: PowerShell
detection:
  condition:
    sigma: "`powershell` EventCode=4104 \n  -  eval DoIt = if(match(Message,\"(?i)(\\\
      $doit)\"), \"4\", 0) \n  -  eval enccom=if(match(Message,\"[A-Za-z0-9+\\/]{44,}([A-Za-z0-9+\\\
      /]{4}\n  - [A-Za-z0-9+\\/]{3}=\n  - [A-Za-z0-9+\\/]{2}==)\") OR match(Message,\
      \ \"(?i)[-]e(nc*o*d*e*d*c*o*m*m*a*n*d*)*\\s+[^-]\"),4,0) \n  -  eval suspcmdlet=if(match(Message,\
      \ \"(?i)Add-Exfiltration\n  - Add-Persistence\n  - Add-RegBackdoor\n  - Add-ScrnSaveBackdoor\n\
      \  - Check-VM\n  - Do-Exfiltration\n  - Enabled-DuplicateToken\n  - Exploit-Jboss\n\
      \  - Find-Fruit\n  - Find-GPOLocation\n  - Find-TrustedDocuments\n  - Get-ApplicationHost\n\
      \  - Get-ChromeDump\n  - Get-ClipboardContents\n  - Get-FoxDump\n  - Get-GPPPassword\n\
      \  - Get-IndexedItem\n  - Get-Keystrokes\n  - LSASecret\n  - Get-PassHash\n\
      \  - Get-RegAlwaysInstallElevated\n  - Get-RegAutoLogon\n  - Get-RickAstley\n\
      \  - Get-Screenshot\n  - Get-SecurityPackages\n  - Get-ServiceFilePermission\n\
      \  - Get-ServicePermission\n  - Get-ServiceUnquoted\n  - Get-SiteListPassword\n\
      \  - Get-System\n  - Get-TimedScreenshot\n  - Get-UnattendedInstallFile\n  -\
      \ Get-Unconstrained\n  - Get-VaultCredential\n  - Get-VulnAutoRun\n  - Get-VulnSchTask\n\
      \  - Gupt-Backdoor\n  - HTTP-Login\n  - Install-SSP\n  - Install-ServiceBinary\n\
      \  - Invoke-ACLScanner\n  - Invoke-ADSBackdoor\n  - Invoke-ARPScan\n  - Invoke-AllChecks\n\
      \  - Invoke-BackdoorLNK\n  - Invoke-BypassUAC\n  - Invoke-CredentialInjection\n\
      \  - Invoke-DCSync\n  - Invoke-DllInjection\n  - Invoke-DowngradeAccount\n \
      \ - Invoke-EgressCheck\n  - Invoke-Inveigh\n  - Invoke-InveighRelay\n  - Invoke-Mimikittenz\n\
      \  - Invoke-NetRipper\n  - Invoke-NinjaCopy\n  - Invoke-PSInject\n  - Invoke-Paranoia\n\
      \  - Invoke-PortScan\n  - Invoke-PoshRat\n  - Invoke-PostExfil\n  - Invoke-PowerDump\n\
      \  - Invoke-PowerShellTCP\n  - Invoke-PsExec\n  - Invoke-PsUaCme\n  - Invoke-ReflectivePEInjection\n\
      \  - Invoke-ReverseDNSLookup\n  - Invoke-RunAs\n  - Invoke-SMBScanner\n  - Invoke-SSHCommand\n\
      \  - Invoke-Service\n  - Invoke-Shellcode\n  - Invoke-Tater\n  - Invoke-ThunderStruck\n\
      \  - Invoke-Token\n  - Invoke-UserHunter\n  - Invoke-VoiceTroll\n  - Invoke-WScriptBypassUAC\n\
      \  - Invoke-WinEnum\n  - MailRaider\n  - New-HoneyHash\n  - Out-Minidump\n \
      \ - Port-Scan\n  - PowerBreach\n  - PowerUp\n  - PowerView\n  - Remove-Update\n\
      \  - Set-MacAttribute\n  - Set-Wallpaper\n  - Show-TargetScreen\n  - Start-CaptureServer\n\
      \  - VolumeShadowCopyTools\n  - NEEEEWWW\n  - (Computer\n  - User)Property\n\
      \  - CachedRDPConnection\n  - get-net\\S+\n  - invoke-\\S+hunter\n  - Install-Service\n\
      \  - get-\\S+(credent\n  - password)\n  - remoteps\n  - Kerberos.*(policy\n\
      \  - ticket)\n  - netfirewall\n  - Uninstall-Windows\n  - Verb\\s+Runas\n  -\
      \ AmsiBypass\n  - nishang\n  - Invoke-Interceptor\n  - EXEonRemote\n  - NetworkRelay\n\
      \  - PowerShelludp\n  - PowerShellIcmp\n  - CreateShortcut\n  - copy-vss\n \
      \ - invoke-dll\n  - invoke-mass\n  - out-shortcut\n  - Invoke-ShellCommand\"\
      ),1,0) \n  -  eval base64 = if(match(lower(Message),\"frombase64\"), \"4\",\
      \ 0) \n  -  eval empire=if(match(lower(Message),\"system.net.webclient\") AND\
      \ match(lower(Message), \"frombase64string\") ,5,0) \n  -  eval mimikatz=if(match(lower(Message),\"\
      mimikatz\") OR match(lower(Message), \"-dumpcr\") OR match(lower(Message), \"\
      SEKURLSA::Pth\") OR match(lower(Message), \"kerberos::ptt\") OR match(lower(Message),\
      \ \"kerberos::golden\") ,5,0) \n  -  eval iex = if(match(lower(Message),\"iex\"\
      ), \"2\", 0) \n  -  eval webclient=if(match(lower(Message),\"http\") OR match(lower(Message),\"\
      web(client\n  - request)\") OR match(lower(Message),\"socket\") OR match(lower(Message),\"\
      download(file\n  - string)\") OR match(lower(Message),\"bitstransfer\") OR match(lower(Message),\"\
      internetexplorer.application\") OR match(lower(Message),\"xmlhttp\"),5,0) \n\
      \  -  eval get = if(match(lower(Message),\"get-\"), \"1\", 0) \n  -  eval rundll32\
      \ = if(match(lower(Message),\"rundll32\"), \"4\", 0) \n  -  eval suspkeywrd=if(match(Message,\
      \ \"(?i)(bitstransfer\n  - mimik\n  - metasp\n  - AssemblyBuilderAccess\n  -\
      \ Reflection\\.Assembly\n  - shellcode\n  - injection\n  - cnvert\n  - shell\\\
      .application\n  - start-process\n  - Rc4ByteStream\n  - System\\.Security\\\
      .Cryptography\n  - lsass\\.exe\n  - localadmin\n  - LastLoggedOn\n  - hijack\n\
      \  - BackupPrivilege\n  - ngrok\n  - comsvcs\n  - backdoor\n  - brute.?force\n\
      \  - Port.?Scan\n  - Exfiltration\n  - exploit\n  - DisableRealtimeMonitoring\n\
      \  - beacon)\"),1,0) \n  -  eval syswow64 = if(match(lower(Message),\"syswow64\"\
      ), \"3\", 0) \n  -  eval httplocal = if(match(lower(Message),\"http://127.0.0.1\"\
      ), \"4\", 0) \n  -  eval reflection = if(match(lower(Message),\"reflection\"\
      ), \"1\", 0) \n  -  eval invokewmi=if(match(lower(Message), \"(?i)(wmiobject\n\
      \  - WMIMethod\n  - RemoteWMI\n  - PowerShellWmi\n  - wmicommand)\"),5,0) \n\
      \  -  eval downgrade=if(match(Message, \"(?i)([-]ve*r*s*i*o*n*\\s+2)\") OR match(lower(Message),\"\
      powershell -version\"),3,0) \n  -  eval compressed=if(match(Message, \"(?"
  level: critical
tags:
- "T1059\nT1059.001"
- Command and Scripting Interpreter
- Command and Scripting Interpreter
references: Requires PowerShell logs
notes: Threat Hunting rule. Not meant to be a scheduled search.
