title: ESCU - GetWmiObject User Account with PowerShell Script Block - Rule
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Get-WmiObject` commandlet used with specific parameters.
  The `Win32_UserAccount` parameter is used to return a list of all local users. Red
  Teams and adversaries may leverage this commandlet to enumerate users for situational
  awareness and Active Directory Discovery.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "`powershell` EventCode=4104 (Message=\"*Get-WmiObject*\" AND Message=\"\
      *Win32_UserAccount*\") \n  -  stats count min(_time) as firstTime max(_time)\
      \ as lastTime by EventCode Message ComputerName User \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `getwmiobject_user_account_with_powershell_script_block_filter`"
  level: critical
tags:
- T1087.001
- 'Account Discovery: Local Account'
- Discovery
references: Requires PowerShell logs
notes: .nan
