title: ESCU - Attempted Credential Dump From Registry via Reg exe - Rule
description: Monitor for execution of reg.exe with parameters specifying an export
  of keys that contain hashed credentials that attackers may try to crack offline.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where `process_reg`\
      \ OR `process_cmd` Processes.process=*save* (Processes.process=*HKEY_LOCAL_MACHINE\\\
      \\Security* OR Processes.process=*HKEY_LOCAL_MACHINE\\\\SAM* OR Processes.process=*HKEY_LOCAL_MACHINE\\\
      \\System* OR Processes.process=*HKLM\\\\Security* OR Processes.process=*HKLM\\\
      \\System* OR Processes.process=*HKLM\\\\SAM*) by Processes.dest Processes.user\
      \ Processes.parent_process Processes.process_name Processes.original_file_name\
      \ Processes.process Processes.process_id Processes.parent_process_id \n  - \
      \ `drop_dm_object_name(Processes)` \n  -  `security_content_ctime(firstTime)`\n\
      \  -  `security_content_ctime(lastTime)` \n  -  `attempted_credential_dump_from_registry_via_reg_exe_filter`"
  level: critical
tags:
- "T1003.002\nT1003"
- 'OS Credential Dumping: Security Account Manager'
- 'OS Credential Dumping: Security Account Manager'
references: "Increase Windows logging to include Registry events\nIncrease Windows\
  \ logging to include command line data"
notes: .nan
