title: ESCU - Windows Java Spawning Shells - Rule
description: The following analytic identifies the process name of java.exe and w3wp.exe
  spawning a Windows shell. This is potentially indicative of exploitation of the
  Java application and may be related to current event CVE-2021-44228 (Log4Shell).
  The shells included in the macro are "cmd.exe", "powershell.exe". Upon triage, review
  parallel processes and command-line arguments to determine legitimacy.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=java.exe\
      \ OR Processes.parent_process_name=w3wp.exe `windows_shells` by Processes.dest\
      \ Processes.user Processes.parent_process_name Processes.process_name Processes.process\
      \ Processes.process_id Processes.parent_process_id \n  -  `drop_dm_object_name(Processes)`\
      \ \n  -  `security_content_ctime(firstTime)` \n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `windows_java_spawning_shells_filter`"
  level: critical
tags:
- T1190
- Exploit Public-Facing Application
- Initial Access
references: Increase Windows logging to include command line data
notes: THIS IS A EXPERIMENTAL DETECTION
