title: ESCU - Dump LSASS via comsvcs DLL
description: Detect the usage of comsvcs.dll for dumping the lsass process.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: .nan
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where `process_rundll32`\
      \ Processes.process=*comsvcs.dll* Processes.process=*MiniDump* by Processes.user\
      \ Processes.process_name Processes.original_file_name Processes.process Processes.dest\
      \ \n  -  `drop_dm_object_name(Processes)` \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `dump_lsass_via_comsvcs_dll_filter`"
  level: critical
tags:
- T1003.001
- 'OS Credential Dumping: LSASS Memory'
- Credential Access
references: Requires Sysmon data
notes: .nan
