title: ESCU - Windows Service Created Within Public Path - Rule
description: The following analytc uses Windows Event Id 7045, `New Service Was Installed`,
  to identify the creation of a Windows Service where the service binary path is located
  in public paths. This behavior could represent the installation of a malicious service.
  Red Teams and adversaries alike may create malicious Services for lateral movement
  or remote code execution
status: Active
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "`wineventlog_system` EventCode=7045 Service_File_Name = \"*\\.exe\" NOT\
      \ (Service_File_Name IN (\"C:\\\\Windows\\\\*\", \"C:\\\\Program File*\", \"\
      C:\\\\Programdata\\\\*\", \"%systemroot%\\\\*\")) \n  -  stats count min(_time)\
      \ as firstTime max(_time) as lastTime by ComputerName EventCode Service_File_Name\
      \ Service_Name Service_Start_Type Service_Type \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `windows_service_created_within_public_path_filter`"
  level: critical
tags:
- T1543.003
- 'Create or Modify System Process: Windows Service'
- Persistence, Privilege Escalation
references: .nan
notes: .nan
