title: ESCU - Local Account Discovery with Net - Rule
description: This analytic looks for the execution of `net.exe` or `net1.exe` with
  command-line arguments utilized to query for local users. The two arguments `user`
  and 'users', return a list of all local users. Red Teams and adversaries alike use
  net.exe to enumerate users for situational awareness and Active Directory Discovery.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where `process_net`\
      \ (Processes.process=*user OR Processes.process=*users) by Processes.dest Processes.user\
      \ Processes.parent_process Processes.process_name Processes.process Processes.process_id\
      \ Processes.parent_process_id \n  -  `drop_dm_object_name(Processes)` \n  -\
      \  `security_content_ctime(firstTime)` \n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `local_account_discovery_with_net_filter`"
  level: critical
tags:
- T1087.001
- 'Account Discovery: Local Account'
- Discovery
references: Increase Windows logging to include command line data
notes: .nan
