title: ESCU - Certutil exe certificate extraction - Rule
description: This search looks for arguments to certutil.exe indicating the manipulation
  or extraction of Certificate. This certificate can then be used to sign new authentication
  tokens specially inside Federated environments such as Windows ADFS.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=certutil.exe\
      \ Processes.process = \"*-exportPFX*\" by Processes.dest Processes.user Processes.parent_process\
      \ Processes.process_name Processes.process Processes.process_id Processes.parent_process_id\
      \ \n  -  `drop_dm_object_name(Processes)` \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `certutil_exe_certificate_extraction_filter`"
  level: critical
tags:
- T1588
- Obtain Capabilities
- Resource Development
references: Increase Windows logging to include command line data
notes: .nan
