title: ESCU - Windows Service Created With Suspicious Service Path - Rule
description: The following analytc uses Windows Event Id 7045, `New Service Was Installed`,
  to identify the creation of a Windows Service where the service binary path path
  is located in a non-common Service folder in Windows. Red Teams and adversaries
  alike may create malicious Services for lateral movement or remote code execution
  as well as persistence and execution. The Clop ransomware has also been seen in
  the wild abusing Windows services.
status: Active
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "`wineventlog_system` EventCode=7045 Service_File_Name = \"*\\.exe\" NOT\
      \ (Service_File_Name IN (\"C:\\\\Windows\\\\*\", \"C:\\\\Program File*\", \"\
      C:\\\\Programdata\\\\*\", \"%systemroot%\\\\*\")) \n  -  stats count min(_time)\
      \ as firstTime max(_time) as lastTime by EventCode Service_File_Name Service_Name\
      \ Service_Start_Type Service_Type \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `windows_service_created_with_suspicious_service_path_filter`"
  level: critical
tags:
- T1569.002
- 'System Services: Service Execution'
- Execution
references: .nan
notes: .nan
