title: ESCU - Multiple Archive Files Http Post Traffic - Rule
description: This search is designed to detect high frequency of archive files data
  exfiltration through HTTP POST method protocol. This are one of the common techniques
  used by APT or trojan spy after doing the data collection like screenshot, recording,
  sensitive data to the infected machines. The attacker may execute archiving command
  to the collected data, save it a temp folder with a hidden attribute then send it
  to its C2 through HTTP POST. Sometimes adversaries will rename the archive files
  or encode/encrypt to cover their tracks. This detection can detect a renamed archive
  files transfer to HTTP POST since it checks the request body header. Unfortunately
  this detection cannot support archive that was encrypted or encoded before doing
  the exfiltration.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Firewall
detection:
  condition:
    sigma: "`stream_http` http_method=POST \n  - eval archive_hdr1=substr(form_data,1,2)\
      \ \n  -  eval archive_hdr2 = substr(form_data,1,4) \n  - stats values(form_data)\
      \ as http_request_body min(_time) as firstTime max(_time) as lastTime count\
      \ by http_method http_user_agent uri_path url bytes_in bytes_out archive_hdr1\
      \ archive_hdr2 \n  - where count >20 AND (archive_hdr1 = \"7z\" OR archive_hdr1\
      \ = \"PK\" OR archive_hdr2=\"Rar!\") \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `multiple_archive_files_http_post_traffic_filter`"
  level: critical
tags:
- "T1048.003\nT1048"
- 'Exfiltration Over Alternative Protocol: Exfiltration Over Unencrypted Non-C2 Protocol'
- 'Exfiltration Over Alternative Protocol: Exfiltration Over Unencrypted Non-C2 Protocol'
references: Requires HTTP Stream logs
notes: .nan
