title: ESCU - Sdclt UAC Bypass - Rule
description: This search is to detect a suspicious sdclt.exe registry modification.
  This technique is commonly seen when attacker try to bypassed UAC by using sdclt.exe
  application by modifying some registry that sdclt.exe tries to open or query with
  payload file path on it to be executed.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Registry where (Registry.registry_path=\
      \ \"*\\\\Windows\\\\CurrentVersion\\\\App Paths\\\\control.exe*\" OR Registry.registry_path=\
      \ \"*\\\\exefile\\\\shell\\\\runas\\\\command\\\\*\") (Registry.registry_value_name\
      \ = \"(Default)\" OR Registry.registry_value_name = \"IsolatedCommand\") by\
      \ _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name\
      \ Registry.process_guid Registry.registry_key_name Registry.registry_value_data\
      \ \n  -  `drop_dm_object_name(Registry)` \n  - rename process_guid as proc_guid\
      \ \n  - join proc_guid, _time [\n  -  tstats `security_content_summariesonly`\
      \ count FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id\
      \ Processes.process_name Processes.process Processes.dest Processes.parent_process_name\
      \ Processes.parent_process Processes.process_guid \n  -  `drop_dm_object_name(Processes)`\
      \ \n  - rename process_guid as proc_guid \n  -  fields _time dest user parent_process_name\
      \ parent_process process_name process_path process proc_guid registry_path registry_value_name\
      \ registry_value_data registry_key_name] \n  -  table _time dest user parent_process_name\
      \ parent_process process_name process_path process proc_guid registry_path registry_value_name\
      \ registry_value_data registry_key_name \n  -  `sdclt_uac_bypass_filter`"
  level: critical
tags:
- T1548.002
- 'Abuse Elevation Control Mechanism: Bypass User Account Control'
- Defense Evasion, Privilege Escalation
references: Increase Windows logging to include Registry events
notes: .nan
