title: ESCU - Create local admin accounts using net exe - Rule
description: This search looks for the creation of local administrator accounts using
  net.exe .
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count values(Processes.user)\
      \ as user values(Processes.parent_process) as parent_process min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=net.exe\
      \ OR Processes.process_name=net1.exe) AND Processes.process=*/add* AND (Processes.process=*administrators*\
      \ OR Processes.process=*administratoren* OR Processes.process=*administrateurs*\
      \ OR Processes.process=*administrador* OR Processes.process=*amministratori*\
      \ OR Processes.process=*administratorer*) by Processes.process Processes.process_name\
      \ Processes.dest \n  -  `drop_dm_object_name(Processes)` \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `create_local_admin_accounts_using_net_exe_filter`"
  level: critical
tags:
- "T1136.001\nT1136"
- 'Create Account: Local Account'
- 'Create Account: Local Account'
references: Increase Windows logging to include command line data
notes: .nan
