title: ESCU - Detect Empire with PowerShell Script Block Logging - Rule
description: "The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)\
  \ to identify suspicious PowerShell execution. Script Block Logging captures the\
  \ command sent to PowerShell, the full command to be executed. Upon enabling, logs\
  \ will output to Windows event logs. Dependent upon volume, enable on critical endpoints\
  \ or all. \nThis analytic identifies the common PowerShell stager used by PowerShell-Empire.\
  \ Each stager that may use PowerShell all uses the same pattern. The initial HTTP\
  \ will be base64 encoded and use `system.net.webclient`. Note that some obfuscation\
  \ may evade the analytic. \nDuring triage, review parallel processes using an EDR\
  \ product or 4688 events. It will be important to understand the timeline of events\
  \ around this activity. Review the entire logged PowerShell script block."
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: "PowerShell\nWindows"
detection:
  condition:
    sigma: "`powershell` EventCode=4104  (Message=*system.net.webclient* AND Message=*frombase64string*)\
      \ \n  -  stats count min(_time) as firstTime max(_time) as lastTime by OpCode\
      \ ComputerName User EventCode Message \n  -  `security_content_ctime(firstTime)`\
      \ \n  -  `security_content_ctime(lastTime)` \n  -  `detect_empire_with_powershell_script_block_logging_filter`"
  level: critical
tags:
- "T1059\nT1059.001"
- Command and Scripting Interpreter
- Command and Scripting Interpreter
references: Increase Windows logging to include command line data and powershell logs
notes: .nan
