title: ESCU - GetAdComputer with PowerShell Script Block - Rule
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Get-AdGroup` commandlet. The `Get-AdGroup` commandlet
  is used to return a list of all domain computers. Red Teams and adversaries may
  leverage this commandlet to enumerate domain computers for situational awareness
  and Active Directory Discovery.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "`powershell` EventCode=4104 (Message = \"*Get-AdComputer*\") \n  -  stats\
      \ count min(_time) as firstTime max(_time) as lastTime by EventCode Message\
      \ ComputerName User \n  -  `security_content_ctime(firstTime)` \n  -  `getadcomputer_with_powershell_script_block_filter`"
  level: critical
tags:
- T1018
- Remote System Discovery
- Discovery
references: Requires PowerShell logs
notes: .nan
