title: ESCU - DNS Exfiltration Using Nslookup App - Rule
description: this search is to detect potential DNS exfiltration using nslookup application.
  This technique are seen in couple of malware and APT group to exfiltrated collected
  data in a infected machine or infected network. This detection is looking for unique
  use of nslookup where it tries to use specific record type, TXT, A, AAAA, that are
  commonly used by attacker and also the retry parameter which is designed to query
  C2 DNS multiple tries.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` values(Processes.process)\
      \ as process values(Processes.process_id) as process_id values(Processes.parent_process)\
      \ as parent_process count min(_time) as firstTime max(_time) as lastTime from\
      \ datamodel=Endpoint.Processes where Processes.process_name = \"nslookup.exe\"\
      \ Processes.process = \"*-querytype=*\" OR Processes.process=\"*-qt=*\" OR Processes.process=\"\
      *-q=*\" OR Processes.process=\"-type=*\" OR Processes.process=\"*-retry=*\"\
      \ by Processes.dest Processes.user Processes.process_name  \n  -  `drop_dm_object_name(Processes)`\
      \ \n  -  `security_content_ctime(firstTime)` \n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `dns_exfiltration_using_nslookup_app_filter`"
  level: critical
tags:
- T1048
- Exfiltration Over Alternative Protocol
- Exfiltration
references: Increase Windows logging to include command line data
notes: .nan
