title: ESCU - Creation of Shadow Copy - Rule
description: Monitor for signs that Vssadmin or Wmic has been used to create a shadow
  copy.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=vssadmin.exe\
      \ Processes.process=*create* Processes.process=*shadow*) OR (Processes.process_name=wmic.exe\
      \ Processes.process=*shadowcopy* Processes.process=*create*) by Processes.dest\
      \ Processes.user Processes.process_name Processes.process  Processes.parent_process\
      \ Processes.process_id Processes.parent_process_id \n  -  `drop_dm_object_name(Processes)`\
      \ \n  -  `security_content_ctime(firstTime)`\n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `creation_of_shadow_copy_filter`"
  level: critical
tags:
- "T1003.003\nT1003"
- 'OS Credential Dumping: NTDS'
- 'OS Credential Dumping: NTDS'
references: Increase Windows logging to include command line data
notes: .nan
