title: ESCU - Suspicious Ticket Granting Ticket Request - Rule
description: As part of the sAMAccountName Spoofing (CVE-2021-42278) and Domain Controller
  Impersonation (CVE-2021-42287) exploitation chain, adversaries will need to request
  a Kerberos Ticket Granting Ticket (TGT) on behalf of the newly created and renamed
  computer account. The TGT request will be preceded by a computer account name event.
  This analytic leverages Event Id 4781, `The name of an account was changed` and
  event Id 4768 `A Kerberos authentication ticket (TGT) was requested` to correlate
  a sequence of events where the new computer account on event id 4781 matches the
  request account on event id 4768. This behavior could represent an exploitation
  attempt of CVE-2021-42278 and CVE-2021-42287 for privilege escalation.
status: Active
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "`wineventlog_security` (EventCode=4781 Old_Account_Name=\"*$\" New_Account_Name!=\"\
      *$\") OR (EventCode=4768 Account_Name!=\"*$\") \n  -  eval RenamedComputerAccount\
      \ = coalesce(New_Account_Name, mvindex(Account_Name,0)) \n  -  transaction RenamedComputerAccount\
      \ startswith=(EventCode=4781) endswith=(EventCode=4768) \n  -  eval short_lived=case((duration<2),\"\
      TRUE\") \n  -  short_lived = TRUE \n  -  table _time, ComputerName, EventCode,\
      \ Account_Name,RenamedComputerAccount, short_lived \n  - `suspicious_ticket_granting_ticket_request_filter`"
  level: critical
tags:
- T1078.002
- 'Valid Accounts: Domain Accounts'
- Defense Evasion, Initial Access, Persistence, Privilege Escalation
references: .nan
notes: .nan
