title: ESCU - Suspicious MSBuild Rename - Rule
description: The following analytic identifies renamed instances of msbuild.exe executing.
  Msbuild.exe is natively found in C:\Windows\Microsoft.NET\Framework\v4.0.30319 and
  C:\Windows\Microsoft.NET\Framework64\v4.0.30319. During investigation, identify
  the code executed and what is executing a renamed instance of MSBuild.
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name!=msbuild.exe\
      \ AND Processes.original_file_name=MSBuild.exe by Processes.dest Processes.user\
      \ Processes.parent_process_name Processes.process_name Processes.process Processes.process_id\
      \ Processes.parent_process_id Processes.original_file_name \n  -  `drop_dm_object_name(Processes)`\
      \ \n  -  `security_content_ctime(firstTime)` \n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `suspicious_msbuild_rename_filter`"
  level: critical
tags:
- T1036.003
- 'Masquerading: Rename System Utilities'
- Defense Evasion
references: Increase windows logging to include file creation, deletion and modification
notes: .nan
