title: ESCU - Windows AdFind Exe - Rule
description: 'This search looks for the execution of `adfind.exe` with command-line
  arguments that it uses by default. Specifically the filter or search functions.
  It also considers the arguments necessary like objectcategory, see readme for more
  details: https://www.joeware.net/freetools/tools/adfind/usage.htm. This has been
  seen used before by Wizard Spider, FIN6 and actors whom also launched SUNBURST.
  AdFind.exe is usually used a recon tool to enumare a domain controller.'
status: Missing Data Source
author: DS
logsource:
  product: Splunk
  service: splunkd
  category: Windows
detection:
  condition:
    sigma: "\n  -  tstats `security_content_summariesonly` count min(_time) as firstTime\
      \ max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process=\"\
      * -f *\" OR Processes.process=\"* -b *\") AND (Processes.process=*objectcategory*\
      \ OR Processes.process=\"* -gcb *\" OR Processes.process=\"* -sc *\") by Processes.dest\
      \ Processes.user Processes.process_name Processes.process Processes.parent_process\
      \ Processes.process_id Processes.parent_process_id \n  -  `drop_dm_object_name(Processes)`\
      \ \n  -  `security_content_ctime(firstTime)` \n  -  `security_content_ctime(lastTime)`\
      \ \n  -  `windows_adfind_exe_filter`"
  level: critical
tags:
- T1018
- Remote System Discovery
- Discovery
references: Increase Windows logging to include command line data
notes: .nan
